org-pm.el

(defun org-babel-load-current-file ()
  (interactive)
  (org-babel-load-file (buffer-file-name (current-buffer))))  
(global-set-key (kbd "C-c C-=") 'org-babel-load-current-file)

(defvar org-pm-project-components nil
"Store the projects that each file or its sections belong to.
For each file it store a list: (full-path project1 project2 ...)")

(defvar org-pm-auto-parse nil
  "If not nil, automatically parse a org-mode buffer
 for org-pm data before saving it.")

(defvar org-pm-auto-copy nil
"If not nil, automatically copy file components to a project to the 
project's source folder before publishing.")

(defvar org-pm-project-data-file-path nil
"Path of file for storing org-publish-project-alist and 
org-pm-project-components.  If nil, the path is deduced from the existence
of .emacs.d folder in user's home directory. 
If .emacs.d exists, use ~/.emacs.d/savefile/org-publish-project-alist
else use ~/.org-publish-project-alist.  
Create savefile folder if it does not exist.")

(defvar org-pm-default-project-name "org-pm-default"
"Name of default, auto-generated project.")

(defvar org-pm-default-project-org-folder "~/pm-org"
"Path of folder for source files of default project.")

(defvar org-pm-default-project-html-folder "~/pm-html"
  "Path of folder for html (published website) files of default project.")

(defvar org-pm-default-project-plist 
  '(
    :base-extension "org"
    :recursive t
    :publishing-function org-publish-org-to-html
    :headline-levels 5
    :auto-preamble t
  )
"The defalt properties for publishing a project with html.
Used to provide initial contents when creating a project plist in 
org-pm-make-default-project-plist. "
)

(defvar org-pm-project-template-name 
  (concat (file-name-directory (or load-file-name (buffer-file-name)))
          "org-pm-project-template.org")
"Full path of file containing template of project definition for 
projects generated automatically with org-pm-make-project-template-file.
The path is initialized at code loading time by function org-pm-init-project-template-name.
org-pm-make-project-template-file uses it to make project templates.")

(defun assoc-add (alist key element)
  "Add element to the sublist of alist which starts with key."
  (let ((sublist (assoc key alist)))
    (if sublist
        (setcdr sublist (cons element (cdr sublist)))
      (if alist
          (setcdr alist (cons (list key element) (cdr alist)))
        (setq alist (list (list key element))))))
  alist)

(defun assoc-remove (alist key element)
  "Remove element from the sublist of alist whose car is equal to key."
  (when alist
    (let ((sublist (assoc key alist)))
      (when sublist
        (setcdr sublist(remove element (cdr sublist)))
        (if (equal 1 (length sublist)) (setq alist (remove sublist alist))))
      alist)))

(defun assoc-remove-key (alist key)
  "Remove all sublists of alist whose car is equal to key."
  (setq alist (remove* key alist :test 'equal :key 'car)))

  ;;; older version
(defun assoc-remove-key-simple-style (alist key)
  "Remove all sublists of alist whose car is equal to key."
  (let (found)
    (while (setq found (assoc key alist))
      (setq alist (delq found alist)))
    alist))

(defun assoc-replace (alist key newlist)
  "Remove all sublists of alist whose car is equal to key, and then
     add (cons key newlist) to alist."
  (setq alist (assoc-remove-key alist key))
  (setq alist (cons (cons key newlist) alist))
  )

(defun org-pm-make-default-project-plist ()
  "Construct default plist for publishing a project in html."
  (let ((plist (copy-sequence org-pm-default-project-plist)))
    (setq plist (plist-put plist :base-directory
                           (file-truename org-pm-default-project-org-folder)))
    (setq plist (plist-put plist :publishing-directory 
                           (file-truename org-pm-default-project-html-folder)))))

(defun org-pm-add-project-file (project-name file)
  "In list org-pm-project-components, add the project-name to the list 
of projects that file bel ongs. "
  (setq org-pm-project-components
        (assoc-add org-pm-project-components file project-name)))

(defun org-pm-remove-project-file (project-name file)
  "In list org-pm-project-components, add the project-name to the list 
of projects that file belongs. "
  (setq org-pm-project-components
        (assoc-add org-pm-project-components file project-name)))

(defun org-pm-save-projects-and-components ()

)

(defun org-pm-add-project-to-file-header (project-name)

)

(defun org-pm-get-file-projects ()

)

(defun org-pm-get-section-projects ()

)

(defun org-pm-make-project-template-file (project)
