org-pm.org
** org-pm-add-file-to-project:
:PROPERTIES:
:ID:       24187886-5ADA-4263-806B-8655A9813C8B
:END:

#+BEGIN_SRC emacs-lisp
  (defun org-pm-add-file-to-project ()
    "Add the file of the current buffer to a project selected or input by the user.
      If the project selected/input by the user is not already in the file's project list:
      - If no project of that name exists, request that the project be defined using
      org-pm or other methods.
      - If no project at all exists, then offer to create default project.
      - Add the selected project to the file's list in org-pm-project-components.
      - Save org-pm-project-components.
      - Add the project name to property PROJECT in file's header."
    (interactive)
    (unless (buffer-file-name (current-buffer))
      (error "This buffer is not associated with a file.  Please save first."))
    (let* ((org-completion-use-ido t)
           (projects 
            (if org-publish-project-alist
                (mapcar org-publish-project-alist 'car)
              (list org-pm-default-project-name)))
           (project-name
            (org-icompleting-read "Choose or input a project name: " projects)))
      (if (member project-name (org-pm-get-file-projects))
          (error "This file is already part of project '%s'" project-name))
      (setq project (org-pm-query-make-default-project project-name))
      (org-pm-add-project-to-file-header project-name)
      (org-pm-add-project-file project-name (buffer-file-name (current-buffer)))
      (org-pm-save-projects-and-components)
      (org-pm-make-project-template-file project)
      (message 
       "Added project named: %s to file: %s\nBase directory is: %s\nPublishing directory is: %s"
       project-name
       (file-name-nondirectory (buffer-file-name (current-buffer)))
       (plist-get (cdr project) :base-directory)
       (plist-get (cdr project) :publishing-directory))))
  
  (defun org-pm-query-make-default-project (project-name)
    "Make a project using default settings and project-name as name."
    (unless (y-or-n-p (format "Create project '%s'? " project-name))
      (error "Project creation cancelled."))
    (let (plist)
      (setq plist (org-pm-make-default-project-plist))
      (setq plist
            (plist-put 
             plist :base-directory
             (query-make-folder (plist-get plist :base-directory) 
                                "Base directory:")))
      (setq plist 
            (plist-put 
             plist :publishing-directory
             (query-make-folder (plist-get plist :publishing-directory) 
                                "Publishing directory:")))
      (cons project-name plist)))
  
  (defun query-make-folder (path &optional prompt-string)
    "If folder at path does not exist, then show dialog offering to user 
      the option to create the indicated folder or to choose another path.
      If the path selected does not exist, create folder."
    (setq path (file-truename path))
    (unless prompt-string (setq prompt-string "Folder select or create:"))
    (let ((answer
           (read-file-name
            (format 
             "%s\nSelect or input folder (folder will be created if needed):\n"
             prompt-string)
            path)))
      (unless (equal (file-truename answer) (buffer-file-name (current-buffer))) 
        (setq path answer))
      (unless (file-exists-p path) (make-directory path))
      path))
  
#+END_SRC elisp

#+BEGIN_SRC elisp
  (let ((result
         (read-file-name "test" "~/")))
    (if (equal (file-truename result) (buffer-file-name (current-buffer)))
        "this would be the original default"
      result)
  )
#+END_SRC

#+RESULTS:
: this would be the original default

#+BEGIN_SRC elisp
(query-make-folder "~/pm-org")
#+END_SRC

#+RESULTS:
: ~/Documents/Dev/Emacs/org-publish-meta/org-pm.org

** org-pm-remove-file-from-project:

** org-pm-publish: Select a project to publish from the projects targeted by current buffer. 

Since a file containing org-pm tags can be anywhere outside an org-mode project folder, one cannot use org-publish-current-project to automatically provide the target project based on the file.  Therefore, use =org-pm-publish= instead to select the desired project to publish from a list of projects that are targeted by the current file.

** org-pm-make-projects (called by org-pm-parse-buffer)

** org-pm-make-component-project-list: 

** org-pm-copy-components:

org-pm-copy-components can be called explicitly by the user as a command.

If org-pm-auto-copy is enabled, then it is called automatically whenever a project is published. 

** org-pm-enable-auto: 

** org-pm-disable-auto: 
:PROPERTIES:
:ID:       5D8EF403-7567-4C82-B919-37ED86C3D268
:END:


* Handling links

Open issue in this part: Not clear if org-id will register duplicate links when opening files from projects which contain parts copied from other files through org-pm.  Apart from that, the following approach should work.

** Use unique id for links
:PROPERTIES:
:DATE:     <2013-11-29 Fri 00:12>
:ID:       D9BE6D1C-0139-4A61-9DC1-BAEA24192ED8
:END:

When the org-id packages is installed, and org-id-link-to-org-use-id is set to t, then links created with C-c l (org-store-link) and inserted with C-c C-l (org-insert-link) will work even if the sections containing the links are moved to another file.  Note: the description at http://orgmode.org/manual/Handling-links.html states this, but the description regarding using CUSTOM_ID is a bit short and unclear.  I tried out setting org-id-link-to-org-use-id to t and it works consistently.  I do not use CUSTOM_ID.  

See further more: [[id:F1DBFCAD-39E9-477F-83A5-25FFBEEFD442][Converting links in the files copied to base directories for publication]].

#+BEGIN_SRC elisp
(require 'org-id)
(setq org-id-link-to-org-use-id t)
;; (defvar org-only-store-id-links t)
#+END_SRC

** Converting links in the files copied to base directories for publication
:PROPERTIES:
:DATE:     <2013-12-20 Fri 20:46>
:ID:       F1DBFCAD-39E9-477F-83A5-25FFBEEFD442
:END:

Org-id stores the list of links with their locations in variable =org-id-locations=.  This should be used by org-pm to provide the right paths to links in the files copied to the base directories of projects for publication.


