org-pm.el

(defun org-pm-add-file-to-project ()
  "Add the file of the current buffer to a project selected or input by the user.
    If the project selected/input by the user is not already in the file's project list:
    - If no project of that name exists, request that the project be defined using
    org-pm or other methods.
    - If no project at all exists, then offer to create default project.
    - Add the selected project to the file's list in org-pm-project-components.
    - Save org-pm-project-components.
    - Add the project name to property PROJECT in file's header."
  (interactive)
  (unless (buffer-file-name (current-buffer))
    (error "This buffer is not associated with a file.  Please save first."))
  (let* ((org-completion-use-ido t)
         (projects 
          (if org-publish-project-alist
              (mapcar org-publish-project-alist 'car)
            (list org-pm-default-project-name)))
         (project-name
          (org-icompleting-read "Choose or input a project name: " projects)))
    (if (member project-name (org-pm-get-file-projects))
        (error "This file is already part of project '%s'" project-name))
    (setq project (org-pm-query-make-default-project project-name))
    (org-pm-add-project-to-file-header project-name)
    (org-pm-add-project-file project-name (buffer-file-name (current-buffer)))
    (org-pm-save-projects-and-components)
    (org-pm-make-project-template-file project)
    (message 
     "Added project named: %s to file: %s\nBase directory is: %s\nPublishing directory is: %s"
     project-name
     (file-name-nondirectory (buffer-file-name (current-buffer)))
     (plist-get (cdr project) :base-directory)
     (plist-get (cdr project) :publishing-directory))))

(defun org-pm-query-make-default-project (project-name)
  "Make a project using default settings and project-name as name."
  (unless (y-or-n-p (format "Create project '%s'? " project-name))
    (error "Project creation cancelled."))
  (let (plist)
    (setq plist (org-pm-make-default-project-plist))
    (setq plist
          (plist-put 
           plist :base-directory
           (query-make-folder (plist-get plist :base-directory) 
                              "Base directory:")))
    (setq plist 
          (plist-put 
           plist :publishing-directory
           (query-make-folder (plist-get plist :publishing-directory) 
                              "Publishing directory:")))
    (cons project-name plist)))

(defun query-make-folder (path &optional prompt-string)
  "If folder at path does not exist, then show dialog offering to user 
    the option to create the indicated folder or to choose another path.
    If the path selected does not exist, create folder."
  (setq path (file-truename path))
  (unless prompt-string (setq prompt-string "Folder select or create:"))
  (let ((answer
         (read-file-name
          (format 
           "%s\nSelect or input folder (folder will be created if needed):\n"
           prompt-string)
          path)))
    (unless (equal (file-truename answer) (buffer-file-name (current-buffer))) 
      (setq path answer))
    (unless (file-exists-p path) (make-directory path))
    path))
